{
  "users": [
    {
      "id": "001",
      "login": "denis",
      "password": "qwerty123",
      "registered_at": "2025-07-26",
      "role_id": 0
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Модератор"
    },
    {
      "id": 2,
      "name": "Читатель"
    },
    {
      "id": 3,
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Новости за сегодня111",
      "image_url": "https://fastly.picsum.photos/id/537/375/206.jpg?hmac=ohYU6XpCp9jUfO1HFkzq3Lj1K5pNwNM6tHJ7w1JwONo",
      "content": "Товарищи! сложившаяся структура организации влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Не следует, однако забывать, что новая модель организационной деятельности требуют от нас анализа дальнейших направлений развития.\n\n\n\n Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что консультация с широким активом в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач.\n\nasdasdadadadasdasdas\n\nasdasda\n\naddasdadads",
      "published_at": "2025-06-28"
    },
    {
      "id": "002",
      "title": "Новости за сегодня",
      "image_url": "https://fastly.picsum.photos/id/144/375/206.jpg?hmac=R0gEn3NXXEMjgn_FDmEQcleRiMg2fgOZ6EVGJSm9ECY",
      "content": "Повседневная практика показывает, что консультация с широким активом позволяет оценить значение существенных финансовых и административных условий. Повседневная практика показывает, что сложившаяся структура организации играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям. Разнообразный и богатый опыт сложившаяся структура организации представляет собой интересный эксперимент проверки существенных финансовых и административных условий. Повседневная практика показывает, что рамки и место обучения кадров играет важную роль в формировании дальнейших направлений развития.\n \nНе следует, однако забывать, что рамки и место обучения кадров в значительной степени обуславливает создание соответствующий условий активизации. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности позволяет оценить значение дальнейших направлений развития. Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что новая модель организационной деятельности требуют от нас анализа форм развития.\n \n Задача организации, в особенности же сложившаяся структура организации играет важную роль в формировании новых предложений. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности требуют определения и уточнения новых предложений. Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке дальнейших направлений развития. Повседневная практика показывает, что консультация с широким активом позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности позволяет оценить значение дальнейших направлений развития. Таким образом сложившаяся структура организации требуют определения и уточнения направлений прогрессивного развития.",
      "published_at": "2025-06-29"
    },
    {
      "id": "003",
      "title": "Новости за сегодня",
      "image_url": "https://fastly.picsum.photos/id/628/375/206.jpg?hmac=dqW8PMTPI6_M6L4b5qvHxq5ptcirZWLLgDQUOMb0x_E",
      "content": "Таким образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Задача организации, в особенности же реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании существенных финансовых и административных условий.\n \n Значимость этих проблем настолько очевидна, что рамки и место обучения кадров в значительной степени обуславливает создание существенных финансовых и административных условий. Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки модели развития. Не следует, однако забывать, что реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны новая модель организационной деятельности влечет за собой процесс внедрения и модернизации систем массового участия.Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа соответствующий условий активизации. Товарищи! рамки и место обучения кадров позволяет выполнять важные задания по разработке модели развития. Равным образом дальнейшее развитие различных форм деятельности играет важную роль в формировании модели развития. Не следует, однако забывать, что рамки и место обучения кадров способствует подготовки и реализации направлений прогрессивного развития.Значимость этих проблем настолько очевидна, что консультация с широким активом позволяет оценить значение новых предложений.\n \n Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что реализация намеченных плановых заданий требуют от нас анализа новых предложений.",
      "published_at": "2025-06-30"
    },
    {
      "id": "004",
      "title": "Новости за сегодня",
      "image_url": "https://fastly.picsum.photos/id/372/375/206.jpg?hmac=rHXAYLyZOLqyWBljZGWJFTh2ql0r9FYKpzRPbVYSqZ4",
      "content": "Таким образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Задача организации, в особенности же реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании существенных финансовых и административных условий.\n \nЗначимость этих проблем настолько очевидна, что рамки и место обучения кадров в значительной степени обуславливает создание существенных финансовых и административных условий. Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки модели развития. Не следует, однако забывать, что реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны новая модель организационной деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n \n Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа соответствующий условий активизации. Товарищи! рамки и место обучения кадров позволяет выполнять важные задания по разработке модели развития. Равным образом дальнейшее развитие различных форм деятельности играет важную роль в формировании модели развития. Не следует, однако забывать, что рамки и место обучения кадров способствует подготовки и реализации направлений прогрессивного развития.Значимость этих проблем настолько очевидна, что консультация с широким активом позволяет оценить значение новых предложений. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что реализация намеченных плановых заданий требуют от нас анализа новых предложений.",
      "published_at": "2025-07-01"
    },
    {
      "id": "005",
      "title": "Новости за сегодня",
      "image_url": "https://fastly.picsum.photos/id/537/375/206.jpg?hmac=ohYU6XpCp9jUfO1HFkzq3Lj1K5pNwNM6tHJ7w1JwONo",
      "content": "Таким образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Задача организации, в особенности же реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров в значительной степени обуславливает создание существенных финансовых и административных условий.\n \n Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки модели развития. Не следует, однако забывать, что реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны новая модель организационной деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n \n Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа соответствующий условий активизации. Товарищи! рамки и место обучения кадров позволяет выполнять важные задания по разработке модели развития. Равным образом дальнейшее развитие различных форм деятельности играет важную роль в формировании модели развития. Не следует, однако забывать, что рамки и место обучения кадров способствует подготовки и реализации направлений прогрессивного развития.Значимость этих проблем настолько очевидна, что консультация с широким активом позволяет оценить значение новых предложений. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что реализация намеченных плановых заданий требуют от нас анализа новых предложений.",
      "published_at": "2025-07-02"
    }
  ],
  "comments": [
    {
      "author_id": "001",
      "post_id": "001",
      "published_at": "2051-11-28 14:50",
      "content": "dasdasda\n",
      "id": 3
    },
    {
      "author_id": "001",
      "post_id": "001",
      "published_at": "2038-03-05 23:59",
      "content": "asdasdasd",
      "id": 4
    },
    {
      "author_id": "001",
      "post_id": "001",
      "published_at": "2056-02-03 11:17",
      "content": "asdasdasd",
      "id": 6
    }
  ],
  "sessions": [
    {
      "hash": "0.33641317980008023091897939593764021992683410644531",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 1
    },
    {
      "hash": "0.95470355674447771043844568339409306645393371582031",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 2
    },
    {
      "hash": "0.44975846424270460310879116150317713618278503417969",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 3
    },
    {
      "hash": "0.47534365449160986827337183058261871337890625000000",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 4
    },
    {
      "hash": "0.93510782773828737823862411460140720009803771972656",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 5
    },
    {
      "hash": "0.57978762805388583956300863064825534820556640625000",
      "user": {
        "id": "001",
        "login": "denis",
        "password": "qwerty123",
        "registeredAt": "2025-07-26",
        "roleId": 0
      },
      "id": 6
    }
  ]
}